Revit 2027 API
UIDocument.PromptForFamilyInstancePlacement Method
Overload List
Name | Description
PromptForFamilyInstancePlacement(FamilySymbol) | Prompts the user to place instances of the specified FamilySymbol.
PromptForFamilyInstancePlacement(FamilySymbol, PromptForFamilyInstancePlacementOptions) | Prompts the user to place instances of the specified FamilySymbol.
Top
See Also
Reference
UIDocument Class
Autodesk.Revit.UI Namespace